Revit 2027 API
ExtendedPropertiesLink.Create Method
 Creates the ExtendedPropertiesLink in the given document.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static LinkLoadResult Create(
	Document doc,
	ExternalResourceReference externalReference
)
Public Shared Function Create (
	doc As Document,
	externalReference As ExternalResourceReference
) As LinkLoadResult
public:
static LinkLoadResult^ Create(
	Document^ doc,
	ExternalResourceReference^ externalReference
)
static member Create :
        doc : Document *
        externalReference : ExternalResourceReference -> LinkLoadResult
Parameters
doc Document
 Document which will gain an ExtendedPropertiesLink.
externalReference ExternalResourceReference
 Reference to external information containing extended properties.
Return Value
LinkLoadResult
 Information about the ExtendedPropertiesLink.
Exceptions
Exception | Condition
ArgumentException |  The server referenced by the ExternalResourceReference does not exist or does not implement IExternalResourceServer. -or- The ExternalResourceReference (externalReference) is not in a format that is supported by its server. -or- The given externalReference does not refer to a server that supports extended properties. -or- The document does not support extended properties links.
ArgumentNullException |  A non-optional argument was null
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
See Also
Reference
ExtendedPropertiesLink Class
Autodesk.Revit.DB.ExternalData Namespace